ednieuw/Fibonacci-Nano-ESP32-clock/Old/ESP32ArduinoFibonacci_V007/ESP32ArduinoFibonacci_V007.ino
if (Mem.TimeInput == 3)
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
  {
    case 0: ReworkInputString("Q0");  break;                                                  // Button "0"
    case 1: ReworkInputString("Q1");  break;                                                  // Button "1"
    case 2: ReworkInputString("Q2");  break;                                                  // Button "2"
    case 3: ReworkInputString("Q3");  break;                                                  // Button "3"
    case 4: ReworkInputString("Q4");  break;                                                  // Button "4"
    case 5: ReworkInputString("Q5");  break;                                                  // Button "5"
    case 6: ReworkInputString("Q6");  break;                                                  // Button "6"
    case 7: ReworkInputString("Q7");  break;                                                  // Button "7"
    case 8: ReworkInputString("Q8");  break;                                                  // Button "8"
    case 9: ReworkInputString("Q9");  break;                                                  // Button "9"                                               // Turn displaychoice on
    case 10:                                                                                  // Button "UP"
    case 11:                                                                                  // Button "DOWN"
    case 12:                                                                                  // Button "LEFT"
    case 13:                                                                                  // Button "RIGHT"
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15:                                                                                  // Button "OK"
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            snprintf(sptext, sizeof(sptext), "Button '%s' not yet assigned", ButtonName.c_str());

            break;
  }
 }
 else
 {
 switch(ButtonNamesNr)
  {
    case 0 ... 9:                                                                             // Button "0 - 9"
            EnteredDigits += ButtonName;                                                      // Add digit to entered string  
            if (EnteredDigits.length() > 6) {EnteredDigits = EnteredDigits.substring(0, 6); } // Limit to 6 digits (HHMMSS)
            if (EnteredDigits.length() == 6)
              {
               snprintf(sptext, sizeof(sptext), "Time entered: %c%c:%c%c:%c%c (press OK)", 
                 EnteredDigits[0], EnteredDigits[1], EnteredDigits[2], 
                 EnteredDigits[3], EnteredDigits[4], EnteredDigits[5]);
              }
            else snprintf(sptext, sizeof(sptext), "Digits: %s (Need 6 for HHMMSS)", EnteredDigits.c_str());
            Tekstprintln(sptext);
            break;
    case 10:                                                                                  // Button "UP"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 11:                                                                                  // Button "DOWN"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 12:                                                                                  // Button "LEFT"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 13:                                                                                  // Button "RIGHT"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 14:                                                                                  // Button "POWER"
            ToggleIRpower();
            break;
    case 15: 
            learningMode = false;                                                             // Button "OK"
//          Serial.println(EnteredDigits.length());   
            if (EnteredDigits.length() == 6) {ReworkInputString(EnteredDigits); EnteredDigits = "";}
            else  { Tekstprintln("⚠ Need 6 digits (HHMMSS) before OK");  }
            break;
    case 16:                                                                                  // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintlnf("Button '%s' not yet assigned", ButtonName.c_str());
            break;
  }
 }
 }  // end if ==3

if (Mem.TimeInput == 4)                                                                       // {"MIN-1", "MIN+1","UUR-1","UUR+1","POWER","ONOFF"};
 {
 if (IR_PowerOnstate == false) // && ButtonNamesNr < 14 ) 
 {
 switch(ButtonNamesNr)
    {
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintln("Turn On remote with POWER");
            break;
    }
  }
 else
   {
    switch(ButtonNamesNr)
     {
    case 0:                                                                                   // Button "MIN-1"
            AdjustTime(0, -1, 0);                                                             // -1 minute
            break;
    case 1:                                                                                   // Button "MIN+1"
            AdjustTime(0, 1, 0);                                                              // +1 minute
            break;
    case 2:                                                                                   // Button "UUR-1"
            AdjustTime(-1, 0, 0);                                                             // -1 hour
            break;
    case 3:                                                                                   // Button "UUR+1"
            AdjustTime(1, 0, 0);                                                              // +1 hour
            break;
    case 4:                                                                                   // Button "POWER"
            ToggleIRpower();
            break;
    case 5:                                                                                   // Button "ONOFF"
            ReworkInputString("O");                                                           // Turn On OFF display
            break;
    default:
            Tekstprintlnf("Button '%s' not yet assigned", ButtonName.c_str());
            break;
      }
   }
 } // end if ==4
}

//--------------------------------------------                                                //
// IR-RECEIVER Adjust current time by hours/minutes/seconds
//--------------------------------------------
void AdjustTime(int DeltaHours, int DeltaMinutes, int DeltaSeconds)
{
 timeinfo.tm_hour += DeltaHours;
 timeinfo.tm_min  += DeltaMinutes;
 timeinfo.tm_sec  += DeltaSeconds;
 //time_t t = 
 mktime(&timeinfo);
 if(DS3231Installed)   SetDS3231Time();
 Displaytime();  Tekstprintln("");     
}

//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower(void)
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}


//   Ringbuffer

//--------------------------------------------                                                //
// LOGBUFFER Initialize circular logging buffer
//--------------------------------------------
void InitLogBuffer() 
{
 size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
 size_t reserve = 5000000;                                                                      // much smaller reserve needed — PSRAM is separate from internal RAM
 StoredStartHeaps(true);                                                                      // Store the values before allocation                                                                               //                                     // Keep a safety margin tune this based on your system
 if (largest > reserve) LogBufferSize = largest - reserve;
 else LogBufferSize = largest / 2;
 LogBuffer = (char*)heap_caps_malloc(LogBufferSize, MALLOC_CAP_SPIRAM);
 if (!LogBuffer)                                                                              // Fallback to internal RAM if no PSRAM available
    {
     largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
     reserve = 120000;
     LogBufferSize = (largest > reserve) ? largest - reserve : largest / 2;
     LogBuffer = (char*) heap_caps_malloc(LogBufferSize, MALLOC_CAP_8BIT);
    }
 if (!LogBuffer) { Tekstprintln("ERROR: Could not allocate log buffer");     return;  }
 memset(LogBuffer, 0, LogBufferSize);                                                         // Fill the buffer with 0
 LogWritePos = 0;
 LogWrapped = false;
 Tekstprintlnf("Log buffer allocated: %u bytes (largest block was %u)", (unsigned)LogBufferSize, (unsigned)largest);
}

//--------------------------------------------                                                //
// LOGBUFFER Add a log line (raw C-string). Always ends with '\n'.
//--------------------------------------------
void AddLog(const char* msg) 
{
  if (DoNotLog) return;
  if (!LogBuffer) return;
  size_t len = strlen(msg);
  if (len >= LogBufferSize) {msg += (len - LogBufferSize);  len = strlen(msg); }              // Keep only last part
  for (size_t i = 0; i < len; i++) 
    {
     LogBuffer[LogWritePos++] = msg[i];
     if (LogWritePos >= LogBufferSize)  { LogWritePos = 0;  LogWrapped = true; }              // If we are at the end then wrap. Essential to find the last 500 lines
    }
}

//--------------------------------------------                                                //
// LOGBUFFER Printlast 500 lines
//--------------------------------------------
void HandleTekstPrint(AsyncWebServerRequest* request) 
{
  if (!LogBuffer) {request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
  AsyncResponseStream* response = request->beginResponseStream("text/plain");
  ssize_t lastNewline = -1;                                                                   // Find the actual end of the last complete line (last \n before LogWritePos)
  ssize_t searchPos = (LogWritePos == 0) ? LogBufferSize - 1 : LogWritePos - 1;
  for (size_t i = 0; i < LogBufferSize; i++) {
    if (LogBuffer[searchPos] == '\n') {lastNewline = searchPos;   break; }
    if (!LogWrapped && searchPos == 0)                            break;
    searchPos = (searchPos == 0) ? LogBufferSize - 1 : searchPos - 1;
  }
  if (lastNewline == -1) 
     { request->send(200, "text/plain", "No complete lines in buffer\n");   return; }         // No complete lines yet
  size_t lineCount = 0;                                                                       // Now count back 100 for testing) (500) lines from lastNewline
  ssize_t pos = lastNewline;
  for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 499; scanned++)             //  499 because we already found one \n
  {
    pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
    if (LogBuffer[pos] == '\n') lineCount++;
    if (!LogWrapped && pos == 0) break;
  }
  size_t start = pos % LogBufferSize;                                                         // Start is the position right after the newline we stopped at
  size_t end   = (lastNewline + 1) % LogBufferSize;                                           // Include the last newline
  if (!LogWrapped || start <= end) {
    response->write(LogBuffer + start, end - start);
  } else {
    response->write(LogBuffer + start, LogBufferSize - start);
    response->write(LogBuffer, end);
  }
  request->send(response);
}

//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer) {request->send(200,"text/plain","Log buffer uninitialized\n"); return;  }
 size_t start   = 0;                                                                          // Calculate start and length of valid data
 size_t dataLen = 0;
 if (!LogWrapped)   { start = 0; dataLen = LogWritePos; }
 else
   {
    ssize_t pos = LogWritePos;                                                                // Find first complete line after LogWritePos (skip partial overwritten line)
    size_t  scanned = 0;
    while (scanned < LogBufferSize && LogBuffer[pos % LogBufferSize] != '\n')
      {
       pos++;
       scanned++;
      }
    pos++;                                                                                    // move past the '\n'
    start   = pos % LogBufferSize;
    dataLen = LogBufferSize - 1;                                                              // almost full buffer, minus the partial line we skipped
   }

 AsyncWebServerResponse *response = request->beginResponse( "text/plain", dataLen,
        [start, dataLen](uint8_t *buffer, size_t maxLen, size_t alreadySent) -> size_t
   {                                                                                          // Use a chunked response — ESPAsyncWebServer streams this without one giant allocation
    if (alreadySent >= dataLen) return 0; // done
    size_t remaining  = dataLen - alreadySent;
    size_t toSend     = min(remaining, maxLen);
    size_t physPos    = (start + alreadySent) % LogBufferSize;                                // Physical position in the ring buffer
    size_t tillEnd    = LogBufferSize - physPos;                                              // How much fits before wrap?
    if (toSend <= tillEnd) { memcpy(buffer, LogBuffer + physPos, toSend); }
    else
       {
        memcpy(buffer,           LogBuffer + physPos, tillEnd);                               // Two-part copy over the wrap boundary
        memcpy(buffer + tillEnd, LogBuffer,           toSend - tillEnd);
        }
    return toSend;
    }
   );
 char filename[80];
 snprintf(filename, sizeof(filename), "attachment; filename=\"%s-log.txt\"", Mem.BLEbroadcastName);
 response->addHeader("Content-Disposition", filename);
 request->send(response);
}

/// ringbuffer

//--------------------------------------------                                                //
// TIMESENDER classes connect disconnect
//--------------------------------------------
// TIMESENDER Characteristic callbacks — fires when client subscribes/unsubscribes
//--------------------------------------------
class TSCharCallbacks : public NimBLECharacteristicCallbacks
{
 void onSubscribe(NimBLECharacteristic* pChar, NimBLEConnInfo& connInfo, uint16_t subValue) override
  {
   TSClientSubscribed = (subValue > 0);                                                       // subValue 1=notify, 2=indicate, 0=unsubscribed
  }
};
